CREATE TABLE Продукты
(
	[Id продукта] INT IDENTITY PRIMARY KEY NOT NULL,
	[Имя продукта] NVARCHAR(50) NOT NULL
);

CREATE TABLE Категории
(
	[Id категории] INT IDENTITY PRIMARY KEY NOT NULL,
	[Имя категории] NVARCHAR(50) NOT NULL
);

CREATE TABLE [Продукты - Категории]
(
	[Id продукта] INT REFERENCES Продукты ([Id продукта]),
	[Id категории] INT REFERENCES Категории ([Id категории])
);

INSERT INTO Категории
VALUES
('Мясо'),
('Мясо птицы'),
('Рыба'),
('Морепродукты'),
('Фрукты'),
('Овощи'),
('Молоко'),
('Жиры, масла'),
('Напитки');

INSERT INTO Продукты
VALUES
('Курица'),
('Свинина'),
('Форель'),
('Сок'),
('Творог'),
('Сыр'),
('Яблоко'),
('Помидор'),
('Печенье'),
('Майонез'),
('Йогурт'),
('Хлеб');

INSERT INTO [Продукты - Категории]
VALUES
(1, 1),
(1, 2),
(2, 1),
(3, 3),
(3, 4),
(4, 9),
(5, 7),
(6, 7),
(7, 5),
(8, 6),
(9, NULL),
(10, 8),
(11, 7),
(12, NULL);